Services/basicStructures/Basic_Structures.accessPixelValue.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:bs">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:accessPixelValue>
   <InputMatFilename></InputMatFilename>
   <returnType></returnType>
   <intToSet>0</intToSet>
   <floatToSet>0</floatToSet>
   <pixelI>0</pixelI>
   <pixelJ>0</pixelJ>
   <channel>0</channel>
  </ns:accessPixelValue>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
