Services/basicStructures/Basic_Structures.createMat.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:bs">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:createMat>
   <rows>0</rows>
   <columns>0</columns>
   <type></type>
   <scalar>-1</scalar>
  </ns:createMat>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
